import os

from .._utils import DATA_ROOT

import re
import pandas as pd

df = pd.read_csv("./dl/data/base/joyo.txt", header=None, skiprows=1, delimiter='\t')

hiragana = \
['あ','い','う','え','お','か','き','く','け','こ','さ','し','す','せ','そ','た','ち','つ','て',
'と','な','に','ぬ','ね','の','は','ひ','ふ','へ','ほ','ま','み','む','め','も','ら','り','る',
'れ','ろ','が','ぎ','ぐ','げ','ご','ざ','じ','ず','ぜ','ぞ','だ','ぢ','づ','で','ど','ば','び',
'ぶ','べ','ぼ','ぱ','ぴ','ぷ','ぺ','ぽ','や','ゆ','よ','わ','を','ん',"ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "っ", "ゃ", "ゅ", "ょ", "ゎ"]

katakana = \
['ア','イ','ウ','エ','オ','カ','キ','ク','ケ','コ','サ','シ','ス','セ','ソ','タ','チ','ツ','テ',
'ト','ナ','ニ','ヌ','ネ','ノ','ハ','ヒ','フ','ヘ','ホ','マ','ミ','ム','メ','モ','ラ','リ','ル',
'レ','ロ','ガ','ギ','グ','ゲ','ゴ','ザ','ジ','ズ','ゼ','ゾ','ダ','ヂ','ヅ','デ','ド','バ','ビ',
'ブ','ベ','ボ','パ','ピ','プ','ペ','ポ','ヤ','ユ','ヨ','ワ','ヲ','ン','ー',"ァ", "ィ", "ゥ", "ェ", "ォ", "ッ", "ャ", "ュ", "ョ", "ヮ"]

alphabet_upper = \
['A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V',
'W','X','Y','Z']

alphabet_lower = \
['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v',
'w','x','y','z']

numetric = ['0','1','2','3','4','5','6','7','8','9']

alphabet_num = alphabet_upper + alphabet_lower + numetric

kigou = \
['(',')','[',']','「','」','『','』','<','>','¥','/','÷','*','+','×','?','=','〜','|',':',
';','。','、','.',',', "&", "【", "】", "\n", "・", '”', "'", "-", "■"]

jyouyou_kanji = df.iloc[:, 0].values.tolist()

add_data = ["咎", "弘", "綺", "晃", "’", "위", "堵", "둑", "蓮", "한", "́", "峯", "揶", "인", "%", "聯", "瀆", "揄", "憑", "礫", "躇", "에", "槻", "郁", "姑", "엄", "唖", "彷", "쉽", "倶", "祷", "자", "사", "喰", "祐", "〈", "絆", "茸", "도", "應", "焉", "蘭", "溜", "爺", "亳", "怜", "를", "藉", "俣", "―", "庵", "牽", "〇", "屁", "皓", "전", "曾", "敦", "欽", "殆", "辻", "哉", "이", "惣", "풍", "檀", "遥", "ヶ", "넘", "浩", "穢", "신", "辰", "일", "∪", "간", "袴", "櫻", "해", "盧", "些", "〕", "讃", "←", "騙", "蔓", "之", "우", "掟", "긴", "貶", "≪", "巳", "옆", "蔚", "φ", "邉", "혐", "恍", "檄", "喋", "烏", "佛", "罠", "醍", "凱", "佑", "靖", "栞", "椀", "柴", "빈", "涜", "捏", "桂", "틀", "鞠", "筈", "贅", "挽", "厨", "$", "죠", "鮨", "迂", "茉", "원", "澤", "琉", "冤", "♂", "靱", "б", "蒟", "楚", "蒻", "碧", "늘", "舘", "輿", "姥", "ヵ", "輔", "筑", "鵜", "로", "게", "嘩", "£", "吊", "髭", "ö", "했", "撫", "속", "문", "歪", "상", "庄", "廣", "噂", "♪", "囁", "捍", "詫", "제", "泄", "顛", "篇", "炸", "實", "菅", "최", "兒", "嶋", "▽", "●", "恫", "麿", "근", "俯", "윙", "^", "─", "亞", "也", "囂", "모", "鉉", "鋲", "幌", "雛", "矜", "肋", "窺", "遼", "ヴ", "賑", "穿", "는", "闊", "昂", "彗", "蒼", "김", "捐", "성", "뜻", "̅", "朋", "莫", "叶", "스", "豹", "斐", "거", "동", "忽", "楠", "拗", "雁", "축", "擢", "呟", "淀", "゚", "憮", "嘘", "繋", "祀", "徽", "絢", "胡", "馴", "牡", "訛", "捧", "吾", "오", "冴", "팬", "☆", "嗚", "嗜", "尖", "강", "綬", "巷", "알", "扮", "憚", "漣", "ω", "觶", "어", "俄", "′", "腿", "只", "코", "`", "#", "만", "桧", "鼠", "痣", "掴", "론", "或", "대", "в", "溢", "떨", "儘", "돌", "보", "巴", "척", "讐", "篠", "噌", "李", "愕", "智", "魏", "萌", "雀", "饉", "차", "져", "들", "嘉", "閔", "난", "〉", "논", "杏", "−", "미", "ヽ", "猥", "貰", "晋", "생", "汐", "漕", "逢", "叩", "晦", "辟", "國", "蹊", "◆", "禿", "槍", "娼", "拿", "狼", "석", "♡", "膠", "데", "儲", "窪", "眞", "세", "瀉", "伊", "辿", "淳", "纏", "럭", "《", "喧", "\"", "畠", "轢", "耶", "滲", "訊", "말", "장", "裳", "猪", "못", "瞰", "涌", "광", "례", "고", "마", "嵌", "폴", "명", "급", "카", "△", "惹", "謳", "醤", "芥", "글", "姦", "柏", "터", "笠", "褻", "覗", "聡", "訣", "杭", "涛", "稀", "灘", "□", "서", "〒", "嬉", "云", "涎", "‘", "凜", "다", "劔", "鋒", "剥", "隼", "荻", "—", "蠣", "炒", "晒", "창", "鳩", "국", "◯", "형", "梶", "揃", "д", "든", "讚", "○", "庇", "與", "舫", "釘", "叱", "﻿", "_", "요", "내", "니", "贄", "綴", "乃", "佇", "란", "왜", "駿", "棲", "紗", "團", "鞍", "曝", "꼬", "중", "鄭", "昌", "蹄", "癌", "詈", "秤", "圭", "倖", "菱", "倭", "這", "諌", "秦", "지", "噛", "醐", "‐", "통", "리", "령", "彦", "유", "逼", "→", "★", "撒", "吠", "餃", "琢", "牌", "舐", "邊", "치", "冨", "捲", "祇", "아", "紐", "피", "洒", "티", "吼", "鱗", "熾", "蘇", "시", "방", "媚", "咤", "기", "“", "旭", "來", "노", "주", "訝", "嘔", "葵", "呆", "遽", "네", "綜", "頬", "欝", "※", "크", "즌", "은", "ν", "芦", "奢", "亮", "磯", "哨", "〔", "蒲", "宏", "寵", "龍", "塵", "까", "狗", "막", "阿", "민", "\\", "》", "痺", "誹", "禄", "!", "르", "惚", "濱", "峻", "정", "怯", "迦", "揉", "々", "莉", "을", "膣", "匡", "빠", "褲", "ヱ", "洩", "謗", "杓", "翔", "脆", "甫", "♯", "濡", "躊", "@", "餐", "毅", "열", "憫", "彿", "剃", "煽", "하", "본", "呑", "萩", "逞", "桐", "烹", "綾", "糞", "董", "玲", "槌"]
#add_data = []

nihongo = hiragana + katakana + alphabet_num + kigou + jyouyou_kanji + add_data

SynthText_class_labels = ['text']
SynthText_class_nums = len(SynthText_class_labels)

#SynthText_char_labels_with_upper = list('0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~')
SynthText_char_labels_with_upper = nihongo
SynthText_char_nums_with_upper = len(SynthText_char_labels_with_upper)

SynthText_char_labels_with_upper_blank = [' '] + SynthText_char_labels_with_upper
SynthText_char_nums_with_upper_blank = len(SynthText_char_labels_with_upper_blank)

#SynthText_char_labels_without_upper = list('0123456789abcdefghijklmnopqrstuvwxyz!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~')
SynthText_char_labels_without_upper = nihongo
SynthText_char_nums_without_upper = len(SynthText_char_labels_without_upper)

SynthText_char_labels_without_upper_blank = [' '] + SynthText_char_labels_without_upper
SynthText_char_nums_without_upper_blank = len(SynthText_char_labels_without_upper_blank)

SynthText_ROOT = os.path.join(DATA_ROOT, 'text', 'SynthText')